In [187]:
import pandas as pd
import numpy as np

Read the data into six separate dataframes.

In [188]:
df1 = pd.read_csv("turnstile_200606.csv")
df2 = pd.read_csv("turnstile_200530.csv")
df3 = pd.read_csv("turnstile_200411.csv")
df4 = pd.read_csv("turnstile_200321.csv")
df5 = pd.read_csv("turnstile_200208.csv")
df6 = pd.read_csv("turnstile_200118.csv")

Concatenate the data into one dataframe.

In [189]:
df = pd.concat([df1, df2, df3, df4, df5, df6])

In [190]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,00:00:00,REGULAR,7419887,2520505
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,04:00:00,REGULAR,7419888,2520505
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,08:00:00,REGULAR,7419895,2520514
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,12:00:00,REGULAR,7419911,2520531
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,16:00:00,REGULAR,7419940,2520553

The DATE and TIME columns are object datatypes, which in Pandas is a string.

In [191]:
print('DATE datatype: {}, TIME datatype: "{}"'.format(df['DATE'].dtypes, df['TIME'].dtypes))

DATE datatype: object, TIME datatype: "object"

In [192]:
df['DATETIME'] = pd.to_datetime(df['DATE'] + ' ' + df['TIME'])

After conversion, the datatype for the DATETIME column is a datetime.

In [193]:
df['DATETIME'].dtypes

dtype('<M8[ns]')

In [194]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,00:00:00,REGULAR,7419887,2520505,2020-05-30 00:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,04:00:00,REGULAR,7419888,2520505,2020-05-30 04:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,08:00:00,REGULAR,7419895,2520514,2020-05-30 08:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,12:00:00,REGULAR,7419911,2520531,2020-05-30 12:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/30/2020,16:00:00,REGULAR,7419940,2520553,2020-05-30 16:00:00

The total entries for each turnstile are observed using the `groupby` function in Pandas.

In [197]:
df.groupby(['C/A', 'UNIT', 'SCP', 'STATION']).sum()

                                      ENTRIES  \
C/A   UNIT SCP      STATION
A002  R051 02-00-00 59 ST          1856312674
           02-00-01 59 ST          1656360047
           02-03-00 59 ST           344531036
           02-03-01 59 ST           360029390
           02-03-02 59 ST          1643674329
...                                       ...
TRAM2 R469 00-00-01 RIT-ROOSEVELT   868760892
           00-03-00 RIT-ROOSEVELT   188318641
           00-03-01 RIT-ROOSEVELT   788266243
           00-05-00 RIT-ROOSEVELT      774684
           00-05-01 RIT-ROOSEVELT     1399608

                                   EXITS
C/A   UNIT SCP      STATION
A002  R051 02-00-00 59 ST                                                  630021138
           02-00-01 59 ST                                                  372796746
           02-03-00 59 ST                                                 1297828534
           02-03-01 59 ST                                                  556973462
           02-03-02 59 ST                                                 2194517735
...                                                                              ...
TRAM2 R469 00-00-01 RIT-ROOSEVELT                                           10683165
           00-03-00 RIT-ROOSEVELT                                            7505729
           00-03-01 RIT-ROOSEVELT                                           99865512
           00-05-00 RIT-ROOSEVELT                                              15624
           00-05-01 RIT-ROOSEVELT                                             121352

[4974 rows x 2 columns]